package order;

import master.Errcheck;

public class Driver2 {

	public static void main(String args[]){

		numCheck();
		exitId();
		notExitId();


	}
	public static void numCheck(){
		Errcheck err = new Errcheck();

		String msg = err.numCheck("20","1234");
		System.out.println(msg);
	}

	public static void exitId(){
		Errcheck err= new Errcheck();

		String msg = err.exitId("00001");
		System.out.println("msg="+msg);
	}

	public static void notExitId(){
		Errcheck err= new Errcheck();

		String msg = err.notExitId("00010");
		System.out.println("msg="+msg);
		「知ってる？猫が自転車に乗ってるところを見たことがあるかい？ネコニシン！」
		「パンがあったらあるほど、食べちゃうって知ってる？それがパンデミック！」
		「コンピューターがミスをすることがあるって知ってる？それがバグだ！」
		「歩くときに大声で歌うといいって知ってる？それがウォーキングデッド！」
		「鳥が糞をするところを見たことがあるかい？それがチョコボールだ！」
		「電球が切れたらどうなると思う？それがアイデアの輝き！」
		「人間はみんな宇宙飛行士なんだよ。だって、どこでも宇宙ステーションだもん！」
		「サイクリングしてるときに、タイヤがパンクすることがあるって知ってる？それがサイクルパンク！」
		「大学生は大抵食べ物に困るって知ってる？それが大学フード！」
		「なぜプレイステーションが良いか知ってる？それがコントローラーのパワー！」
		「カメがステーキを食べるところを見たことがあるかい？それがシェルステーキ！」
		「バンジージャンプが怖いって？大丈夫だよ、一度飛んでみればひとりでに跳べるようになるから！」
		「インターネットが遅いって不満？それはネットが網をかけてるからだよ！」
		「魚が歌うって知ってる？それがツナミ！」
		「漫画が面白いのはなぜかって？コマ割りがあるからだよ！」
		「スマホのバッテリーが減るって？それはエネルギー消費がスマートじゃないからだよ！」
		「犬が空を飛ぶって知ってる？それがハイパーボール！」
		「雨が降ると車がスカートをはいてるみたいになるって知ってる？それがウェットスーツ！」
		「カエルがお風呂に入るところを見たことがあるかい？それがカエルバス！」
		「時計が欲しいって？それなら時が来たら買えばいいじゃない！」
		「地球が大きいって知ってる？それは地球の重さが地球でしか持ち上げられないからだ！」
		「牛が踊るところを見たことがあるかい？それが牛乱舞！」
		「レモンがサッカーをするって知ってる？それがシトラスリーグ！」
		「何が青くて、バカでも知ってることがあるかい？それが空！」
		「カニが大根おろしをするところを見たことがあるかい？それがかにおろし！」
		「電車がうるさいって不満？それは車両が話してるからだよ！」
		「ビールが冷えるって知ってる？それがビールが冷える！」
		「トイレットペーパーがどこに行ったか知ってる？そう、ロールモデル！」
		「ピアノが踊るって見たことがあるかい？それがピアノフェス！」
		「天気予報が当たらないって不満？それは天気が予想外だからだよ！」
		「椅子が歌うって知ってる？それがチェアント！」
		「野菜がロックンロールをするところを見たことがあるかい？それがグリーンデイ！」
		「鳩が車を運転するって知ってる？それがドライブバード！」
		「猫がサッカーをするって知ってる？それがネコイン！」
		「レモンが走るって知ってる？それがレモンラン！」
		「猿がコーヒーを飲むところを見たことがあるかい？それがモンキーコーヒー！」
		「鳥が野球をするって知ってる？それがフライボール！」
		「カメが早く走るって見たことがあるかい？それがタートルスピード！」
		「アヒルがテレビを見るところを見たことがあるかい？それがダックスクリーン！」
		「馬がレースをするって知ってる？それがホースレース！」
		「サルがピアノを弾くって知ってる？それがモンキーケー！」
		「猫がスイカを食べるって知ってる？それがメロンキャット！」
		「カニがバンジージャンプをするって知ってる？それがクラブジャンプ！」
	}
<<<<<<< HEAD




=======
　　　
>>>>>>> 0a63aaa4de8936fc44da5a36c1ea7a5407542b77
}